MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX664F128H.PIC
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="U2TX"/>
      <edc:VirtualPin edc:name="SDO4"/>
      <edc:VirtualPin edc:name="SCL5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="USBID"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RD8"/>
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="ETXD3"/>
      <edc:VirtualPin edc:name="AERXD1"/>
      <edc:VirtualPin edc:name="RTCC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="IC2"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="U1CTS"/>
      <edc:VirtualPin edc:name="U4RX"/>
      <edc:VirtualPin edc:name="SS3"/>
      <edc:VirtualPin edc:name="ETXD2"/>
      <edc:VirtualPin edc:name="AERXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="IC3"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="AECRSDV"/>
      <edc:VirtualPin edc:name="ECOL"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="INT4"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="IC4"/>
      <edc:VirtualPin edc:name="AEREFCLK"/>
      <edc:VirtualPin edc:name="ECRS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="OC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="OC2"/>
      <edc:VirtualPin edc:name="U1RTS"/>
      <edc:VirtualPin edc:name="U4TX"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="AEMDIO"/>
      <edc:VirtualPin edc:name="EMDIO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="OC3"/>
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="SDI3"/>
      <edc:VirtualPin edc:name="SDA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="OC4"/>
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="SDO3"/>
      <edc:VirtualPin edc:name="SCL3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="IC5"/>
      <edc:VirtualPin edc:name="OC5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="PMRD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="ETXERR"/>
      <edc:VirtualPin edc:name="AETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="AERXERR"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="ERXD3"/>
      <edc:VirtualPin edc:name="AETXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="ERXD2"/>
      <edc:VirtualPin edc:name="AETXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="ERXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="ERXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="ECRSDV"/>
      <edc:VirtualPin edc:name="ERXDV"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="EREFCLK"/>
      <edc:VirtualPin edc:name="ERXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="ERXERR"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
